app/controllers/albums_controller.rb

SELECT * FROM `albums` LIMIT 0, 5
SELECT count(*) AS count_all FROM `albums`
---
  def index
   if params[:search]
  @albums=Album.find(:all, :conditions=>['name LIKE?',"%#{params[:search]}%"])
   else
 @albums = Album.paginate(:per_page=>5, :page=>params[:page])

SELECT * FROM `albums` WHERE (`albums`.`id` = 1)
---
  def show
    @album = Album.find(params[:id])

SELECT * FROM `albums` WHERE (`albums`.`id` = 1)
---
  def edit
    @album = Album.find(params[:id])

INSERT INTO `albums` (`image_file_name`, `created_at`, `image_file_size`, `updated_at`, `image_content_type`, `user_id`, `image_updated_at`) VALUES('1.jpg', '2010-12-17 22:33:15', 371944, '2010-12-17 22:33:15', 'image/jpeg', 1, '2010-12-17 22:33:15')
---
  def create
    @album = current_user.albums.create(params[:album])

SELECT * FROM `albums` WHERE (`albums`.`id` = 1)
UPDATE `albums` SET `updated_at` = '2010-12-17 22:07:23', `image_file_size` = 46070, `image_file_name` = '4.jpg', `image_updated_at` = '2010-12-17 22:07:23', `image_content_type` = 'image/jpeg' WHERE `id` = 1
---
  def update
    @album = Album.find(params[:id])

    respond_to do |format|
      if @album.update_attributes(params[:album])