app/controllers/articles_controller.rb

SELECT * FROM `articles` WHERE (name LIKE'%rails%')
SELECT * FROM "articles" LIMIT 5 OFFSET 0
SELECT count(*) AS count_all FROM `articles`
---
  def index
  if params[:search]
  @articles=Article.find(:all, :conditions=>['name LIKE?',"%#{params[:search]}%"])
   else
 @articles = Article.paginate(:per_page=>5, :page=>params[:page])

SELECT * FROM `articles` WHERE (`articles`.`id` = 1)
---
def rate
@article = Article.find(params[:id])

SELECT * FROM `articles` WHERE (`articles`.`id` = 1)
---
  def show
    @article = Article.find(params[:id])

SELECT * FROM `articles` WHERE (`articles`.`id` = 2)
---
  def edit
    @article = Article.find(params[:id])

INSERT INTO "articles" ("name", "photo_file_size", "created_at", "author", "photo_file_name", "updated_at", "photo_content_type", "rating_average", "photo_updated_at", "user_id", "description", "published_at") VALUES('programmer', 627637, '2011-01-04 12:14:53', NULL, 'محمد الجيد022.jpg', '2011-01-04 12:14:53', 'image/jpeg', NULL, '2011-01-04 12:14:52', 1, 'waleed abdalla
UPDATE `articles` SET `updated_at` = '2010-12-14 15:00:53', `author` = '' WHERE `id` = 2
---
  def create
    @article = current_user.articles.create(params[:article])
    @article.update_attribute(:author, current_user.name)

SELECT * FROM `articles` WHERE (`articles`.`id` = 2)
UPDATE `articles` SET `updated_at` = '2010-12-14 15:20:00', `photo_file_name` = '0017d0b5_medium.jpeg', `name` = 'Ruby on Rails', `published_at` = '2010-12-04', `photo_updated_at` = '2010-12-14 15:20:00', `description` = '\r\n\r\nIn Ruby 1.8, there are subtle differences between proc/lambda on the one hand, and Proc.new on the other.\r\n\r\n * What are those differences?\r\n * Can you give guidelines on how to decide which one to choose?\r\n * In Ruby 1.9, proc and lambda are different. What\'s the deal?\r\n\r\nEdit\r\n\r\n@Mike Stone: there\'s no difference between 1.8 and 1.9 in this regard.\r\n\r\n@Accordeon Guy: that\'s the difference I had in mind, but I don\'t think it\'s the whole story. What about next/break/return in procs? What about Ruby 1.9? What about scopes, and returning procs from a method?\r\n', `photo_file_size` = 16040, `photo_content_type` = 'image/jpeg' WHERE `id` = 8
---
  def update
    @article = Article.find(params[:id])
	@article.update_attribute(:author, current_user.email)

SELECT * FROM `articles` WHERE (`articles`.`id` = 2)
DELETE FROM `articles` WHERE `id` = 2
---
  def destroy
    @article = Article.find(params[:id])
    @article.destroy