app/controllers/comments_controller.rb

  def index
    @comments = Comment.all
---
SELECT * FROM `comments`

  def edit
    @comment = Comment.find(params[:id])
---
SELECT * FROM `comments` WHERE (`comments`.`id` = 1)

  def create
  @article=Article.find(params[:article_id])
  @comment = @article.comments.create(params[:comment])
  if current_user
   @comment.update_attribute(:author, current_user.email)
---
SELECT * FROM `articles` WHERE (`articles`.`id` = 1)
INSERT INTO `comments` (`name`, `created_at`, `author`, `updated_at`, `user_id`, `article_id`, `content`, `email`) VALUES(NULL, '2010-12-15 13:57:31', '', '2010-12-15 13:57:31', NULL, 1, '', '')
UPDATE `comments` SET `updated_at` = '2010-12-15 13:57:32', `author` = 'zamnzaman2010@yahoo.com' WHERE `id` = 1

  def update
    @comment = Comment.find(params[:id])
---
SELECT * FROM `comments` WHERE (`comments`.`id` = 1)

  def destroy
    @comment = Comment.find(params[:id])
---
SELECT * FROM `comments` WHERE (`comments`.`id` = 26)