app/controllers/mp3s_controller.rb

SELECT * FROM `mp3s` WHERE (name LIKE'%{params[:search]}%')
SELECT * FROM "mp3s" LIMIT 5 OFFSET 0
---
  def index

  if params[:search]
@mp3s=Mp3.find(:all, :conditions=>['name LIKE?',"%#{params[:search]}%"])
  else
    @mp3s = Mp3.paginate(:per_page=>5, :page=>params[:page])

SELECT * FROM `mp3s` WHERE (`mp3s`.`id` = 1)
---
  def show
    @mp3 = Mp3.find(params[:id])

SELECT * FROM `mp3s` WHERE (`mp3s`.`id` = 1)
---
  def edit
    @mp3 = Mp3.find(params[:id])

INSERT INTO "mp3s" ("name", "photo_file_size", "created_at", "image_file_name", "image_file_size", "photo_file_name", "updated_at", "photo_content_type", "image_content_type", "singer", "photo_updated_at", "user_id", "length", "image_updated_at") VALUES('', NULL, '2010-12-31 21:35:48', NULL, NULL, NULL, '2010-12-31 21:35:48', NULL, NULL, '', NULL, 1, NULL, NULL)
---
  def create
    @mp3 = current_user.mp3s.create(params[:mp3])

SELECT * FROM `mp3s` WHERE (`mp3s`.`id` = 1)
UPDATE `mp3s` SET `updated_at` = '2010-12-16 11:10:39', `photo_file_name` = '0017c595_medium.jpeg', `photo_updated_at` = '2010-12-16 11:10:39', `photo_file_size` = 33836, `photo_content_type` = 'image/jpeg' WHERE `id` = 1
---
  def update
    @mp3 = Mp3.find(params[:id])

    respond_to do |format|
      if @mp3.update_attributes(params[:mp3])

SELECT * FROM "mp3s" WHERE ("mp3s"."id" = 1)
DELETE FROM "mp3s" WHERE "id" = 1
---
  def destroy
    @mp3 = Mp3.find(params[:id])
    @mp3.destroy