app/controllers/users_controller.rb

INSERT INTO `users` (`name`, `salt`, `created_at`, `crypted_password`, `remember_token_expires_at`, `updated_at`, `remember_token`, `roles_mask`, `login`, `roles`, `email`, `invitation_limit`) VALUES('', '93a39dab56d5e1c4a298aa33ca8ba8d7a34098a6', '2010-12-16 00:08:03', '74cd662e5ef199aee305457e0675e9aaf5b3df02', NULL, '2010-12-16 00:08:03', NULL, 0, 'admin', '--- []\n\n', 'zorooking22@gmail.com', 5)
---
  def create
    logout_keeping_session!
    @user = User.new(params[:user])
    Notifier.deliver_gmail_message(@user)
    success = @user && @user.save